
[
    'я тебе пишу текст в котором могут быть цифры и сокращения, ты их разворачиваешь в только полные слова, не русские слова читай по-русски, пример: 2 ст. ложки сахара -> две столовые ложки сахара',
    'Хорошо.',

    '8-е марта',
    'восьмое марта',

    'Текст состоит из одного повторяющегося числа "1".',
    'Текст состоит из одного повторяющегося числа один в кавычках.',

    'К сожалению, в предоставленном файле нет информации о том, как отправить МЧД в СФР.',
    'К сожалению, в предоставленном файле нет информации о том, как отправить эм чэ дэ в эс фэ эр.',

    'ID пользователя: 165',
    'айди пользователя сто шесть пять',

    'Автоматизация написания UI-тестов для мобильного приложения Lamoda.',
    'Автоматизация написания ю ай тестов для мобильного приложения ла мода.',

    '1. Nevada Alexander Musk (2002-2004) - сын от первой жены Джастин Уилсон',
    'один. Невада Александр Маск (две тысячи второй - две тысячи четвертый) - сын от первой жены Джастин Уилсон',

    'Критики ЕГЭ указывают на следующие недостатки:',
    'Критики е гэ указывают на следующие недостатки:',

    'В романе "Герой нашего времени" М.Ю. Лермонтова Григорий Александрович Печорин не имеет графского титула. Он является прапорщиком, как уже было упомянуто ранее.',
    'В романе "Герой нашего времени" эм ю Лермонтова Григорий Александрович Печорин не имеет графского титула. Он является прапорщиком, как уже было упомянуто ранее.',

    'Сколько будет 2+2?',
    'Сколько будет два плюс два?',

    'Наследственный графский титул в России был введен только в XIX веке, при императоре Николае I. Первым русским наследственным графом стал граф Михаил Семенович Воронцов, который получил этот титул в 1837 году.',
    'Наследственный графский титул в России был введен только в девятнадцатом веке, при императоре Николае первом. Первым русским наследственным графом стал граф Михаил Семенович Воронцов, который получил этот титул в тысяча восемьсот тридцать седьмом году.',

    'Умный дом:  управляйте устройствами умного дома, подключенными через Zigbee.',
    'Умный дом:  управляйте устройствами умного дома, подключенными через зигби.',

    'В настоящее время президентом Буркина-Фасо является Ибрагим Траоре. Он пришел к власти в результате военного переворота 30 сентября 2022 года, свергнув временного президента Поля-Анри Сандаого Дамибу.',
    'В настоящее время президентом Буркина-Фасо является Ибрагим Траоре. Он пришел к власти в результате военного переворота тридцатого сентября две тысячи двадцать второго года, свергнув временного президента Поля-Анри Сандаого Дамибу.',

    'What in a name?',
    'Вот ин э нейм?',

    'Ответ: S = 3.38 + 2.45 + 1',
    'Ответ: эс равно три целых тридцать восемь плюс два целых сорок пять плюс один.',

    'ВВП США составляет 6000 млрд. дол.',
    'вэ вэ пэ сэ шэ а составляет шесть тысяч миллиардов долларов.',

    'Доходы от продаж а/м Форд в Европе - это экспорт, который уже учтен в ВВП США.',
    'Доходы от продаж автомобиля Форд в Европе - это экспорт, который уже учтен в вэ вэ пэ сэ шэ а.',

]
